// src/components/landing/pricingData.ts
export interface Plan {
  title: string;
  price: number;
  description: string;
  features: string[];
  popular?: boolean;
}

export const  pricingData: { monthly: Plan[]; yearly: Plan[] } = {
  monthly: [
    {
      title: "البداية",
      price: 99,
      description: "ابدأ رحلتك مع الذكاء الاصطناعي",
      features: [
        "ردود آلية غير محدودة",
        "دعم 3 منصات متاجر",
        "إحصائيات أساسية",
        "دعم فني عبر البريد الإلكتروني"
      ],
    },
    {
      title: "المحترف",
      price: 199,
      description: "أدوات متقدمة لنمو متجرك",
      features: [
        "جميع ميزة البداية",
        "دعم 10 منصات متاجر",
        "إحصائيات متقدمة",
        "دعم فني على مدار الساعة",
        "تكامل مع أنظمة الدفع",
      ],
      popular: true,
    },
    {
      title: "الشركات",
      price: 399,
      description: "حلول مخصصة للشركات الكبرى",
      features: [
        "جميع ميزات المحترف",
        "دعم غير محدود للمتاجر",
        "تقارير مخصصة",
        "مدير مخصص",
        "أولوية في الدعم الفني",
        "حلول مخصصة"
      ],
    },
  ],
  yearly: [
    {
      title: "البداية",
      price: 79,
      description: "ابدأ رحلتك مع الذكاء الاصطناعي",
      features: [
        "ردود آلية غير محدودة",
        "دعم 3 منصات متاجر",
        "إحصائيات أساسية",
        "دعم فني عبر البريد الإلكتروني"
      ],
    },
    {
      title: "المحترف",
      price: 159,
      description: "أدوات متقدمة لنمو متجرك",
      features: [
        "جميع ميزة البداية",
        "دعم 10 منصات متاجر",
        "إحصائيات متقدمة",
        "دعم فني على مدار الساعة",
        "تكامل مع أنظمة الدفع",
      ],
      popular: true,
    },
    {
      title: "الشركات",
      price: 319,
      description: "حلول مخصصة للشركات الكبرى",
      features: [
        "جميع ميزات المحترف",
        "دعم غير محدود للمتاجر",
        "تقارير مخصصة",
        "مدير مخصص",
        "أولوية في الدعم الفني",
        "حلول مخصصة"
      ],
    },
  ],
};
